# Feature файла съдържа описание на високо ниво на тестовия сценарий

Feature: Добавяне на приоритет
# Feature описвала текущия тестов скрипт

	Scenario: Създаване на приоритети от администратор без име
	#	В Scenario се съдържат стъпките и очаквания резултат за определен тестов случай
	#	Същият сценарий може да бъде изпълнен за множество данни, като се използва Scenario Outline:
	#	данните са предоставени от таблична структура, разделена с | |
		Given Трябва да бъде АДМИН
		#	Определя контекст, който трябва да бъде изпълнен
		And отваря прозорец за добавяне на приоритет
		When Въвежда съответните 1 на приоритета
		#	When указва тестовото действие
		And натиска бутон за добавяне на приоритет
		Then Показва се "Добавете име!"
		#	Очакваният резултат от теста може да бъде представен с Then
		
	Scenario: Създаване на приоритети от администратор без точки
		Given Трябва да бъде АДМИН
		And отваря прозорец за добавяне на приоритет
		When Попълва се "Работещ родител"
		And натиска бутон за добавяне на приоритет
		Then Показва се "Добавете точки!"
	
	Scenario: Създаване на приоритети от родител без права
		Given Влиза като РОДИТЕЛ
		And отваря прозорец за добавяне на приоритет
		When натиска бутон за добавяне на приоритет
		Then Показва се "Нямате права за създаване на привилегия!"
	
  Scenario: Успешно добавяне на приоритети от админа
    Given Трябва да бъде АДМИН
    And отваря прозорец за добавяне на приоритет
    When Попълва се "Работещ родител"
    And Въвежда съответните 1 на приоритета
    And натиска бутон за добавяне на приоритет
    Then Показва се "Привилегията е добавена!"

