# Feature файла съдържа описание на високо ниво на тестовия сценарий

Feature: Регистрация на дете
# Feature описвала текущия тестов скрипт
  Scenario: Регистрация чрез успешно попълнени данни
  #	В Scenario се съдържат стъпките и очаквания резултат за определен тестов случай
	#	Същият сценарий може да бъде изпълнен за множество данни, като се използва Scenario Outline:
	#	данните са предоставени от таблична структура, разделена с | |
    Given User-а трябва да бъде родител
    #	Определя контекст, който трябва да бъде изпълнен
    And отваря екрана за регистриране на дете
    When Въвежда "Рени"
    #	When указва тестовото действие
    And въвежда ЕГН 193254548
    And въвежда години 3
    And Натиска бутон за регистриране на дете
    Then Показва съобщение "Детето е регистрирано!"
    #	Очакваният резултат от теста може да бъде представен с Then

	Scenario: Регистриране на дете без въведено име
    Given User-а трябва да бъде родител
    And отваря екрана за регистриране на дете
		When въвежда ЕГН 193254548
    And въвежда години 3
    And Натиска бутон за регистриране на дете
    Then Показва съобщение "Добавете име!"
    
  Scenario: Регистриране на дете без въведено ЕГН
    Given User-а трябва да бъде родител
    And отваря екрана за регистриране на дете
    When Въвежда "Рени"
    And въвежда години 3
    And Натиска бутон за регистриране на дете
    Then Показва съобщение "Добавете ЕГН!"
	
	Scenario: Регистриране на дете без въведени години
    Given User-а трябва да бъде родител
    And отваря екрана за регистриране на дете
    When Въвежда "Рени"
    And въвежда ЕГН 193254548
    And Натиска бутон за регистриране на дете
    Then Показва съобщение "Добавете години!"
    
 Scenario: Регистриране на дете без права
    Given Влиза като АДМИН
    And отваря екрана за регистриране на дете
    And Натиска бутон за регистриране на дете
    Then Показва съобщение "Нямате права за регистриране на дете!"
	